{
  "reviews": [
    {
      "author_name": "C&M Roe",
      "rating": 5,
      "text": "Best boat tour on Maggie. Most tours go out and back but Cliffy does a full lap and there’s plenty of time to explore so you don’t feel rushed. We stopped for lunch at Horseshoe Bay do no need to pack food unless you want to. Cliffy has swum every cove and walked every ridge line on the island so is the ideal tour guide. A great value day out for those who don’t like touristy tours. Highly recommended.",
      "author_url": "https://www.google.com/maps/contrib/102562740782088281962/reviews"
    },
    {
      "author_name": "Katrina Harvey",
      "rating": 5,
      "text": "Fantastic day out with Cliff! So knowledgeable & takes pride in his tours. Awesome snorkelling & love seeing the entire island by boat. Great commentary & interaction with guests. Feeding eagles and the fish was a highlight. Fantastic price and awesome value, best on Magnetic Island! Would definitely take this trip again.",
      "author_url": "https://www.google.com/maps/contrib/114605686184879744045/reviews"
    },
    {
      "author_name": "liz Walker",
      "rating": 5,
      "text": "We had the best day with Cliff last Monday (30/9/24). In superb Maggie Island conditions, Cliff found us three amazing snorkelling locations, we got up close to some extraordinary fish, saw some fabulous coral/reef including giant clams, enjoyed the majestic rock formations, birdlife and balance rocks around the island and were lucky enough to spend our picnic lunch on a beautiful isolated beach with no one in sight but ourselves. A perfect day. Cliff knows the island and surrounds inside out. And is incredibly accomodating in tailoring his tour to meet the needs of the group. This was our second time out with him and we’re already planning the next one. See you next time Cliff!",
      "author_url": "https://www.google.com/maps/contrib/115425244025627030176/reviews"
    },
    {
      "author_name": "Jasmin Klocker",
      "rating": 5,
      "text": "I highly recommend this tour. Cliff takes small groups around the island. This lets you choose what you spend the day doing. Cliff is very flexible with planning the day. We were a group with 13 to 20 year old kids. We got to spend as much time snorkelling as we wanted. Went rock climbing and exploring, stopped for a lunch break then back to snorkelling again. It was a very entertaining day. Cliff knows the island like the back of his hand and combines this knowledge with the weather forecast and tides. We had all equipment provided including some fishing rods.\nI would highly recommend this tour to anyone as the tour will accommodate your activity level and interests. The tour also offers great value for money.",
      "author_url": "https://www.google.com/maps/contrib/100201046159533402672/reviews"
    }
  ],
  "google_reviews_url": "https://www.google.com/maps/place/?q=place_id:ChIJxYB0rUYBfmkRI_Jk0D9nvCo"
}